.data
name: .asciiz "\n Ονοματεπώνυμο: Ηλίας Τσέκα\n"
id: .asciiz "Αριθμός Μητρώου: 3124\n"
semester: .asciiz "Εξάμηνο: 3ο\n"
prompt1: .asciiz "Δώσε τον πρώτο αριθμό: "
prompt2: .asciiz "Δώσε δεύτερο αριθμό: "
result: .asciiz "Sum = "  # 1-7: Εδώ απλά βαφτίζω τα μηνύματα που θα βγάλει το πρόγραμμα με βοηθητικά ονόματα

.text
.globl main
main:
    li $v0, 4 #Αυτη η γραμμη επαναλαμβανετε επειδη χρειζετε για την εκτυπωση των string 
    la $a0, name
    syscall   # 12-14: Εδώ ορίζω το syscall ως μια εντολή που θα εκτυπώσει το μήνυμα που έχει μέσα το name 

    li $v0, 4 
    la $a0, id
    syscall  # Το ίδιο κάνω και για το id ώστε να εμφανιστεί ο Αριθμός Μητρώου 

    li $v0, 4
    la $a0, semester
    syscall # 16-20: Το ίδιο πράγμα με ό,τι κάνω στις γραμμές 12-14, απλά με τον ΑΜ και το εξάμηνο 

    li $v0, 4
    la $a0, prompt1 # Εδώ φορτώνω το μήνυμα που έχει το prompt1 στον καταχωρητή a0 
    syscall # εκτύπωση
    li $v0, 5          
    syscall # 24-25: Δίνω την εντολή στο v0 να πάρει μια τιμή που βάζω εγώ 
    move $t0, $v0      # Εδώ αποθηκεύω τον αριθμό αυτόν 

    li $v0, 4
    la $a0, prompt2
    syscall # Εκτύπωση του δεύτερου μηνύματος 
    li $v0, 5
    syscall
    move $t1, $v0   # 28-32: Κάνω το ίδιο πράγμα με πάνω απλά με τον δεύτερο αριθμό

    add $t2, $t0, $t1 # Πρόσθεση των δύο αριθμών

    li $v0, 4
    la $a0, result
    syscall # 36-37: Εκτύπωση του μηνύματος που λέει "Sum ="
    li $v0, 1          
    move $a0, $t2
    syscall # 38-40: Μεταφέρει το αποτέλεσμα της πρόσθεσης στον εκτυπωτή a0 και το εμφανίζει 

    li $v0, 10
    syscall # Κλείνουμε το πρόγραμμα 
